# OLDHoistSectionDlg

## Description
Show Hoist Cross Section dialog.

```pascal
FUNCTION OLDHoistSectionDlg(VAR crossSection : STRING): BOOLEAN;
```

```python
def vs.OLDHoistSectionDlg():
    return (BOOLEAN, crossSection)
```

## Parameters
|Name|Type|Description|
|---|---|---|
|crossSection|STRING|   |

## Version
Availability: from Vectorworks 2018

## Category
* Truss Analysis